import streamlit as st
from PIL import Image, ImageEnhance
def showResult(detectedDict='',detectedClass='', file_upload='',showDetected=True):
    if showDetected and detectedDict:  
        with st.empty():
            with st.container():
                st.markdown('<h4 class="h4-success">ตรวจพบโรคใบข้าว</h4>', unsafe_allow_html=True)
                #TODO Leaf Blast--------------------------------------------------------------------
                if 0 in detectedDict:
                    with st.expander(f'ตรวจพบโรคใบไหม้ทั้งหมด: {detectedDict[0]} ตำแหน่ง',True):
                        st.markdown(f'<h4 class="tab-subhead">โรคไหม้ (Rice Blast Disease)</h4>', unsafe_allow_html=True)
                        st.markdown('<hr>',unsafe_allow_html=   True)  
                        tab1,tab2,tab3,tab4,tab5 = st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน','ข้อควรระวัง'])
                        with tab2:  
                            st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                        <p class="indent">เชื้อรา Pyricularia oryzae.</p> \
                                        <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                        <p class="indent">พบส่วนใหญ่ในภาคเหนือ ภาคตะวันออกเฉียงเหนือ ภาคตะวันตก และภาคใต้ พบมากในข้าวนาสวน ทั้งนาปีและนาปรัง และข้าวไร่</p>'
                                    , unsafe_allow_html=True
                            )  
                        with tab1:
                            st.markdown('<h5 class="tab-subhead">ระยะกล้า</h5> \
                                    <p class="indent">ใบมีแผลจุดสีน้ำตาลคล้ายรูปตามีสีเทาอยู่ตรงกลางแผลความกว้างของแผลประมาณ 2-5 มิลลิเมตร และความยาวประมาณ 10-15 มิลลิเมตร แผลสามารถขยายลุกลามและกระจายทั่วบริเวณใบถ้าโรครุนแรงกล้าข้าวจะแห้งฟุบตาย</p> \
                                    <h5 class="tab-subhead">ระยะแตกกอ</h5> \
                                    <p class="indent">อาการพบได้ที่ใบข้อต่อของใบ และข้อต่อของลำต้น ขนาดแผลจะใหญ่กว่าที่พบในระยะกล้าแผลลุกลามติดต่อกันได้ที่บริเวณข้อต่อ ใบจะมีลักษณะแผลช้ำสีน้ำตาลดำ และมักหลุดจากกาบใบเสมอ</p> \
                                    <h5>ระยะออกรวง</h5> \
                                    <p class="tab-subhead">ถ้าข้าวเพิ่งจะเริ่มให้รวงเมื่อถูกเชื้อราเข้าทำลายเมล็ดจะลีบหมด แต่ถ้าเป็นโรคตอนรวงข้าวแก่ใกล้เก็บเกี่ยวจะปรากฏรอยแผลช้ำสีน้ำตาลที่บริเวณคอรวง ำให้เปราะหักง่ายรวงข้าวร่วงหล่นเสียหายมาก</p> '
                                ,unsafe_allow_html=True
                            )
                                                
                        with tab3:
                            st.markdown('<p class="indent">พบโรคในแปลงที่ต้นข้าวหนาแน่นทำให้อับลม ถ้าอากาศค่อนข้างเย็น อุณหถูมิประมาณ 22-25 องศาเซลเซียส ลมแรงจะช่วยให้โรคแพร่กระจายได้ดี</p>',unsafe_allow_html=True)
                        with tab4:
                            st.markdown('<p class="indent bold">ใช้พันธุ์ข้าวที่ค่อนข้างต้านทานโรค</p> \
                                    <p class="indent">- ภาคกลาง เช่น สุพรรณบุรี 1 สุพรรณบุรี 60 ปราจีนบุรี 1 พลายงาม ข้าวเจ้าหอมพิษณุโลก 1</p> \
                                    <p class="indent">- ภาคเหนือ และตะวันออกเฉียงเหนือ เช่น ข้าวเจ้าหอมพิษณุโลก 1 สุรินทร์ 1 เหนียวอุบล 2 สันปาตอง 1 หางยี 71 กู้เมืองหลวง ขาวโป่งไคร้ น้ำรู</p> \
                                    <p class="indent">- ภาคใต้ เช่น ดอกพะยอม</p> \
                                    <p class="indent"><span class="bold">หว่านเมล็ดพันธุ์ในอัตราที่เหมาะสม</span> คือ 15-20 กิโลกรัม/ไร่ ควรแบ่งแปลงให้มีการระบายถ่ายเทอากาศดี และไม่ควรใส่ปุ๋ยไนโตรเจนสูงเกินไป ถ้าสูงถึง 50 กิโลกรัม/ไร่ โรคไหม้จะพัฒนาอย่างรวดเร็ว</p> \
                                    <p class="indent"><span class="bold">คลุกเมล็ดพันธุ์ด้วยสารป้องกันกำจัดเชื้อรา</span> เช่น ไตรไซคลาโซล (tricyclazone) คาซูกาไมซิน (kasugamycin) คาร์เบนดาซิม (carbendazim) โพรคลอราซ ตามอัตราที่ระบุ</p> \
                                    <p class="indent"><span class="bold">ในแหล่งที่เคยมีโรคระบาดและพบแผลโรคไหม้ทั่วไป 5 เปอร์เซ็นต์ ของพื้นที่ใบ (ในภาพรวม พบเฉลี่ย 2-3 แผลต่อใบ)</span> ควรฉีดพ่นสารป้องกันกำจัดเชื้อรา เช่น ไตรไซคลาโซล (tricyclazone) คาซูกาไมซิน (kasugamycin) อีดิเฟนฟอส ไอโซโพรไทโอเลน (isoprothiolane) คาร์เบนดาซิม (carbendazim) ตามอัตราที่ระบุ</p>'
                                ,unsafe_allow_html=True)
                        with tab5:
                            st.markdown('<p class="indent"> ข้าวพันธุ์สุพรรณบุรี 1 สุพรรณบุรี 60 และชัยนาท 1 ที่ปลูกในภาคเหนือตอนล่าง พบว่าแสดงอาการรุนแรงในบางพื้นที่ และบางปี โดยเฉพาะเมื่อสภาพแวดล้อมเอื้ออำนวย เช่น ฝนพรำ หรือหมอก น้ำค้างจัด อากาศเย็น ใส่ปุ๋ยมากเกินความจำเป็น หรือเป็นดินหลังน้ำท่วม </p>',unsafe_allow_html=True)
                
                #TODO Bacteria Blight--------------------------------------------------------------------
                if 1 in detectedDict:
                    with st.expander(f'ตรวจพบโรคขอบใบแห้ง: {detectedDict[1]} ตำแหน่ง',True):
                        st.markdown(f'<h4 class="tab-subhead">โรคขอบใบแห้ง (Bacterial Blight Disease)</h4>', unsafe_allow_html=True)
                        st.markdown('<hr>',unsafe_allow_html=   True)  
                        taba1,taba2,taba3,taba4= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                        with taba2:  
                            st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                        <p class="indent">เชื้อแบคทีเรีย Xanthomonas oryzae pv. oryzae (ex Ishiyama) Swings et al.</p> \
                                        <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                        <p class="indent">ภาคเหนือ ภาคตะวันออกเฉียงเหนือ และภาคใต้ พบมากในนาน้ำฝน นาชลประทาน</p>'
                                    , unsafe_allow_html=True
                            )  
                        with taba1:
                            st.markdown('<p class="indent">โรคนี้เป็นได้ตั้งแต่ระยะกล้า แตกกอ จนถึง ออกรวง ต้นกล้าก่อนนำไปปักดำจะมีจุดเล็กๆลักษณะช้ำที่ขอบใบของใบล่าง ต่อมาประมาณ 7-10 วัน จุดช้ำนี้จะขยายกลายเป็นทางสีเหลืองยาวตามใบข้าว ใบที่เป็นโรคจะแห้งเร็ว และสีเขียวจะจางลงเป็นสีเทาๆ อาการในระยะปักดำจะแสดงหลังปักดำแล้วหนึ่งเดือนถึงเดือนครึ่ง ใบที่เป็นโรคขอบใบมีรอยขีดช้ำ ต่อมาจะเปลี่ยนเป็นสีเหลือง ที่แผลมีหยดน้ำสีครีมคล้ายยางสนกลมๆขนาดเล็กเท่าหัวเข็มหมุด ต่อมาจะกลายเป็นสีน้ำตาลและหลุดไปตามลม น้ำหรือฝน ซึ่งจะทำให้โรคสามารถระบาดต่อไปได้ แผลจะขยายไปตามความยาวของใบ บางครั้งขยายเข้าไปข้างในตามความกว้างของใบ ขอบแผลมีลักษณะเป็นขอบลายหยัก แผลนี้เมื่อนานไปจะเปลี่ยนเป็นสีเทา ใบที่เป็นโรคขอบใบจะแห้งและม้วนตามความยาว ในกรณีที่ต้นข้าวมีความอ่อนแอต่อโรคและเชื้อโรคมีปริมาณมากเชื้อจะทำให้ท่อน้ำท่ออาหารอุดตัน ต้นข้าวจะเหี่ยวเฉาและแห้งตายทั้งต้นโดยรวดเร็ว เรียกอาการของโรคนี้ว่า ครีเสก (kresek)</p>'
                                ,unsafe_allow_html=True
                            )
                                                
                        with taba3:
                            st.markdown('<p class="indent">เชื้อสาเหตุโรคสามารถแพร่ไปกับน้ำ ในสภาพแวดล้อมที่มีความชื้นสูง และสภาพที่มีฝนตก ลมพัดแรง จะช่วยให้โรคแพร่ระบาดอย่างกว้างขวางรวดเร็ว</p>',unsafe_allow_html=True)
                        with taba4:
                            st.markdown('<p class="indent"><span class="bold">ใช้พันธุ์ข้าวที่ต้านทาน เช่น พันธุ์สุพรรณบุรี 60 สุพรรณบุรี 90 สุพรรณบุรี 1 สุพรรณบุรี 2 และ กข23</span></p> \
                                    <p class="indent"><span class="bold">ในดินที่อุดมสมบูรณ์ไม่ควรใส่ปุ๋ยไนโตรเจนมาก</span></p> \
                                    <p class="indent"><span class="bold">ไม่ควรระบายน้ำจากแปลงที่เป็นโรคไปสู่แปลงอื่น</span></p> \
                                    <p class="indent"><span class="bold">ควรเฝ้าระวังการเกิดโรคถ้าปลูกข้าวพันธุ์ที่อ่อนแอต่อโรคนี้</span>เช่น พันธุ์ขาวดอกมะลิ 105 กข6 เหนียวสันป่าตอง พิษณุโลก 2  ชัยนาท 1 เมื่อเริ่มพบอาการของโรคบนใบข้าวให้ใช้สารป้องกันกำจัดโรคพืช เช่น ไอโซโพรไทโอเลน คอปเปอร์ไฮดรอกไซด์ เสตร็พโตมัยซินซัลเฟต+ออกซีเตทตราไซคลินไฮโดรคลอร์ไรด์ ไตรเบซิคคอปเปอร์ซัลเฟต</p>'
                                ,unsafe_allow_html=True)   
                
                #TODO Brown Spot--------------------------------------------------------------------
                if 2 in detectedDict:
                    with st.expander(f'ตรวจพบโรคใบจุดสีน้ำตาล: {detectedDict[2]} ตำแหน่ง',True):
                        st.markdown(f'<h4 class="tab-subhead">โรคใบจุดสีน้ำตาล (Brown Spot Disease)</h4>', unsafe_allow_html=True)
                        st.markdown('<hr>',unsafe_allow_html=   True)  
                        tabb1,tabb2,tabb3,tabb4= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                        with tabb2:  
                            st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                        <p class="indent">เชื้อรา Bipolaris oryzae Breda de Haan.</p> \
                                        <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                        <p class="indent">ภาคกลาง ภาคเหนือ ภาคตะวันตก ภาคตะวันออกเฉียงเหนือ และภาคใต้ พบมากในนาน้ำฝน นาชลประทาน</p>'
                                    , unsafe_allow_html=True
                            )  
                        with tabb1:
                            st.markdown('<p class="indent">แผลที่ใบข้าว พบมากในระยะแตกกอมีลักษณะเป็นจุดสีน้ำตาล รูปกลมหรือรูปไข่ ขอบนอกสุดของแผลมีสีเหลือง มีขนาดเส้นผ่าศูนย์กลาง 0.5-1 มิลลิเมตร แผลที่มีการพัฒนาเต็มที่ขนาดประมาณ 1-2 x 4-10 มิลลิเมตร บางครั้งพบแผลไม่เป็นวงกลมหรือรูปไข่ แต่จะเป็นรอยเปื้อนคล้ายสนิมกระจัดกระจายทั่วไปบนใบข้าว แผลยังสามารถเกิดบนเมล็ดข้าวเปลือก(โรคเมล็ดด่าง) บางแผลมีขนาดเล็ก บางแผลอาจใหญ่คลุมเมล็ดข้าวเปลือก ทำให้เมล็ดข้าวเปลือกสกปรก เสื่อมคุณภาพ เมื่อนำไปสีข้าวสารจะหักง่าย</p>'
                                ,unsafe_allow_html=True
                            )
                                                
                        with tabb3:
                            st.markdown('<p class="indent">เกิดจากสปอร์ของเชื้อราปลิวไปตามลม และติดไปกับเมล็ด</p>',unsafe_allow_html=True)
                        with tabb4:
                            st.markdown('<p class="indent bold">ใช้พันธุ์ต้านทานที่เหมาะสมกับสภาพท้องที่ โดยเฉพาะพันธุ์ที่มีคุณสมบัติต้านทานโรคใบสีส้ม</p> \
                                    <p class="indent">- ภาคกลาง ใช้พันธุ์ปทุมธานี 1</p> \
                                    <p class="indent">- ภาคเหนือและภาคตะวันออกเฉียงเหนือ ใช้พันธุ์เหนียวสันป่าตอง และหางยี 71</p> \
                                    <p class="indent"><span class="bold">ปรับปรุงดินโดยการไถกลบฟาง หรือเพิ่มความอุดมสมบูรณ์ดินโดยการปลูกพืชปุ๋ยสด หรือปลูกพืชหมุนเวียนเพื่อช่วยลดความรุนแรงของโรค</span></p> \
                                    <p class="indent"><span class="bold">คลุกเมล็ดพันธุ์ก่อนปลูกด้วยสารป้องกันกำจัดเชื้อรา</span> เช่น แมนโคเซ็บ หรือคาร์เบนดาซิม+แมนโคเซ็บอัตรา 3 กรัม / เมล็ด 1 กิโลกรัม</p> \
                                    <p class="indent"><span class="bold">ใส่ปุ๋ยโปแตสเซียมคลอไรด์ (0-0-60) อัตรา 5-10 กิโลกรัม / ไร่ ช่วยลดความรุนแรงของโรค</span></p> \
                                    <p class="indent"><span class="bold">กำจัดวัชพืชในนา ดูแลแปลงให้สะอาด และใส่ปุ๋ยในอัตราที่เหมาะสม</span></p> \
                                    <p class="indent"><span class="bold">ถ้าพบอาการของโรคใบจุดสีน้ำตาลรุนแรงทั่วไป 10 เปอร์เซ็นต์ของพื้นที่ใบในระยะข้าวแตกกอ หรือในระยะที่ต้นข้าวตั้งท้องใกล้ออกรวง</span> เมื่อพบอาการใบจุดสีน้ำตาลที่ใบธงในสภาพฝนตกต่อเนื่อง อาจทำให้เกิดโรคเมล็ดด่าง ควรพ่นด้วยสารป้องกันกำจัดเชื้อรา เช่น  อีดิเฟนฟอส คาร์เบนดาซิม\
                                        แมนโคเซ็บ หรือคาร์เบนดาซิม+แมนโคเซบ ตามอัตราที่ระบุ</p>'
                                ,unsafe_allow_html=True)                                   
                
                #TODO Sheath Blight--------------------------------------------------------------------
                if 3 in detectedDict:
                    with st.expander(f'ตรวจพบโรคกาบใบแห้ง: {detectedDict[3]} ตำแหน่ง',True):
                        st.markdown(f'<h4 class="tab-subhead">โรคกาบใบแห้ง (Sheath blight Disease)</h4>', unsafe_allow_html=True)
                        st.markdown('<hr>',unsafe_allow_html=   True)  
                        tabc1,tabc2,tabc3,tabc4= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                        with tabc2:  
                            st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                        <p class="indent">เชื้อรา Rhizoctonia solani (Thanatephorus cucumeris (Frank) Donk)</p> \
                                        <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                        <p class="indent">ภาคกลาง ภาคเหนือ และ ภาคใต้ พบมาก ในนาชลประทาน</p>'
                                    , unsafe_allow_html=True
                            )  
                        with tabc1:
                            st.markdown('<p class="indent">เริ่มพบโรคในระยะแตกกอจนถึงระยะใกล้เก็บเกี่ยว ยิ่งต้นข้าวมีการแตกกอมากเท่าใด ต้นข้าวก็จะเบียดเสียดกันมากขึ้น โรคก็จะเป็นรุนแรง ลักษณะแผลสีเขียวปนเทา ขนาดประมาณ 1-4 x 2-10 มิลลิเมตร ปรากฏตามกาบใบ ตรงบริเวณใกล้ระดับน้ำ แผลจะลุกลามขยายใหญ่ขึ้นจนมีขนาดไม่จำกัดและลุกลามขยายขึ้นถึงใบข้าว ถ้าเป็นพันธุ์ข้าวที่อ่อนแอ แผลสามารถลุกลามถึงใบธงและกาบหุ้มรวงข้าว ทำให้ใบและกาบใบเหี่ยวแห้ง ผลผลิตจะลดลงอย่างมากมาย</p>'
                                ,unsafe_allow_html=True
                            )
                                                
                        with tabc3:
                            st.markdown('<p class="indent">เชื้อราสามารถสร้างเม็ดขยายพันธุ์อยู่ได้นานในตอซังหรือวัชพืชในนาตามดินนา และมีชีวิตข้ามฤดูหมุนเวียนทำลายข้าวได้ตลอดฤดูการทำนา</p>',unsafe_allow_html=True)
                        with tabc4:
                            st.markdown('<p class="indent"><span class="bold">หลังเก็บเกี่ยวข้าว และเริ่มฤดูใหม่</span> ควรพลิกไถหน้าดินตากแดดเพื่อทำลายเม็ดขยายพันธุ์ของเชื้อราสาเหตุโรค</p> \
                                    <p class="indent"><span class="bold">กำจัดวัชพืชตามคันนาและแหล่งน้ำ</span>เพื่อลดโอกาศการฟักตัวและเป็นแหล่งสะสมของเชื้อราสาเหตุโรค</p>\
                                    <p class="indent"><span class="bold">ใช้ชีวภัณฑ์บาซิลลัส ซับทิลิส (เชื้อแบคทีเรียปฏิปักษ์) ในอัตราที่ระบุ</span></p>\
                                    <p class="indent"><span class="bold">ใช้สารป้องกันกำจัดเชื้อรา</span>เช่น โพรพิโคนาโซล เพนไซคูรอน (25%ดับบลิวพี) หรืออีดิเฟนเฟอส ตามอัตราที่ระบุโดยพ่นสารป้องกันกำจัดเชื้อรานี้ในบริเวณที่เริ่มพบโรคระบาด ไม่จำเป็นต้องพ่นทั้งแปลง เพราะโรคกาบใบแห้งจะเกิดเป็นหย่อมๆ</p>'
                                ,unsafe_allow_html=True)
                
                #TODO Tungro--------------------------------------------------------------------
                if 4 in detectedDict:
                    with st.expander(f'ตรวจพบโรคใบสีส้ม: {detectedDict[4]} ตำแหน่ง',True):
                        st.write("โรคโรคใบสีส้ม (Rice Tungro Disease)")
                        st.markdown(f'<h4 class="tab-subhead">โรคกาบใบแห้ง (Sheath blight Disease)</h4>', unsafe_allow_html=True)
                        st.markdown('<hr>',unsafe_allow_html=   True)  
                        tabd1,tabd2,tabd3,tabd4= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                        with tabd2:  
                            st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                        <p class="indent">เชื้อไวรัส Rice Tungro Bacilliform Virus (RTBV) และ Rice Tungro Spherical Virus (RTSV)</p> \
                                        <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                        <p class="indent">ภาคกลาง และภาคเหนือตอนล่าง พบมากในนาชลประทาน</p>'
                                    , unsafe_allow_html=True
                            )  
                        with tabd1:
                            st.markdown('<p class="indent">ต้นข้าวเป็นโรคได้ ทั้งระยะกล้า แตกกอ ตั้งท้อง หากข้าวได้รับเชื้อตอนข้าวอายุอ่อน (ระยะกล้าถึงระยะแตกกอ) ข้าวจะเสียหายมากกว่าได้รับเชื้อตอนอายุแก่ (ระยะตั้งท้องถึงระยะออกรวง) ข้าวเริ่มแสดงอาการหลังจากได้รับเชื้อ 15-20 วัน ทั้งนี้แล้วแต่ว่าข้าวจะได้รับเชื้อระยะใด อาการเริ่มต้นใบข้าวจะเริ่มมีสีเหลืองสลับเขียว ต่อมาจะเปลี่ยนเป็นสีเหลือง เริ่มจากปลายใบเข้าหาโคนใบ ถ้าเป็นรุนแรงในระยะกล้าต้นข้าวอาจถึงตาย ต้นที่เป็นโรคจะเตี้ยแคระแกรน ช่วงลำต้นสั้นกว่าปกติมาก ใบใหม่ที่โผล่ออกมามีตำแหน่งต่ำกว่าข้อต่อใบล่าสุด ถ้าเป็นรุนแรงอาจตายทั้งกอ ถ้าไม่ตายจะออกรวงล่าช้ากว่าปกติ ให้รวงเล็ก หรือไม่ออกรวงเลย</p>'
                                ,unsafe_allow_html=True
                            )
                                                
                        with tabd3:
                            st.markdown('<p class="indent">แพร่ระบาดได้โดยเพลี้ยจักจั่นสีเขียวซึ่งเป็นแมลงพาหะ</p>',unsafe_allow_html=True)
                            st.image('tungro_insect.jpeg')
                        with tabd4:
                            st.markdown('<p class="indent"><span class="bold">ใช้พันธุ์ข้าวต้านทานแมลงเพลี้ยจักจั่นสีเขียว เช่น กข1 กข3</span></p> \
                                    <p class="indent"><span class="bold">กำจัดวัชพืช และพืชอาศัยของเชื้อไวรัสและแมลงพาหะนำโรค</span></p>\
                                    <p class="indent"><span class="bold">ใช้สารป้องกันกำจัดแมลงพาหะ</span> ได้แก่ สารฆ่าแมลงในระยะที่แมลงเป็นตัวอ่อน เช่น ไดโนทีฟูเรน หรือ บูโพรเฟซิน หรือ อีโทเฟนพรอกซ์ ไม่ควรใช้สารฆ่าแมลงผสมกันหลายๆ ชนิด หรือใช้สารฆ่าแมลงผสมสารกำจัดโรคพืชหรือสารกำจัดวัชพืช เพราะอาจทำให้ประสิทธิภาพของสารฆ่าแมลงลดลง ไม่ใช้สารกลุ่มไพรีทรอยด์สังเคราะห์ เช่น ไซเพอร์มิทริน ไซฮาโลทริน เดลต้ามิทริน</p>'
                                ,unsafe_allow_html=True)
    elif showDetected and not detectedClass and file_upload != 'กล้องเว็บแคม' : st.markdown('<h4 class="h4-danger">ตรวจไม่พบโรคใบข้าว</h4>', unsafe_allow_html=True)  
    else:
        with st.container():
            #* เชื้อรา ------------------
            with st.expander('เชื้อรา',True):
                tab1,tab2,tab3,tab4,tab5,tab6,tab7,tab8,tab9,tab10 = st.tabs([
                    'โรคไหม้','โรคใบจุดสีน้ำตาล','โรคใบขีดสีน้ำตาล','โรคใบวงสีน้ำตาล','โรคกาบใบแห้ง','โรคการใบเน่า',
                    'โรคเมล็ดด่าง','โรคถอดฝักดาบ','โรคกล้าเน่า','โรคลำต้นเน่า'
                ])
                #TODO โรคไหม้ ---------------------------
                with tab1:
                    tab1a,tab2a,tab3a,tab4a,tab5a = st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน','ข้อควรระวัง'])
                    with tab2a:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อรา Pyricularia oryzae.</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">พบส่วนใหญ่ในภาคเหนือ ภาคตะวันออกเฉียงเหนือ ภาคตะวันตก และภาคใต้ พบมากในข้าวนาสวน ทั้งนาปีและนาปรัง และข้าวไร่</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1a:
                        st.image(Image.open('diseaseDataImage/โรคไหม้ (2).jpg').resize((300,300)))
                        st.markdown('<h5 class="tab-subhead">ระยะกล้า</h5> \
                                <p class="indent">ใบมีแผลจุดสีน้ำตาลคล้ายรูปตามีสีเทาอยู่ตรงกลางแผลความกว้างของแผลประมาณ 2-5 มิลลิเมตร และความยาวประมาณ 10-15 มิลลิเมตร แผลสามารถขยายลุกลามและกระจายทั่วบริเวณใบถ้าโรครุนแรงกล้าข้าวจะแห้งฟุบตาย</p> \
                                <h5 class="tab-subhead">ระยะแตกกอ</h5> \
                                <p class="indent">อาการพบได้ที่ใบข้อต่อของใบ และข้อต่อของลำต้น ขนาดแผลจะใหญ่กว่าที่พบในระยะกล้าแผลลุกลามติดต่อกันได้ที่บริเวณข้อต่อ ใบจะมีลักษณะแผลช้ำสีน้ำตาลดำ และมักหลุดจากกาบใบเสมอ</p> \
                                <h5>ระยะออกรวง</h5> \
                                <p class="tab-subhead">ถ้าข้าวเพิ่งจะเริ่มให้รวงเมื่อถูกเชื้อราเข้าทำลายเมล็ดจะลีบหมด แต่ถ้าเป็นโรคตอนรวงข้าวแก่ใกล้เก็บเกี่ยวจะปรากฏรอยแผลช้ำสีน้ำตาลที่บริเวณคอรวง ำให้เปราะหักง่ายรวงข้าวร่วงหล่นเสียหายมาก</p> '
                            ,unsafe_allow_html=True
                        )
                                            
                    with tab3a:
                        st.markdown('<p class="indent">พบโรคในแปลงที่ต้นข้าวหนาแน่นทำให้อับลม ถ้าอากาศค่อนข้างเย็น อุณหถูมิประมาณ 22-25 องศาเซลเซียส ลมแรงจะช่วยให้โรคแพร่กระจายได้ดี</p>',unsafe_allow_html=True)
                    with tab4a:
                        st.markdown('<p class="indent bold">ใช้พันธุ์ข้าวที่ค่อนข้างต้านทานโรค</p> \
                                <p class="indent">- ภาคกลาง เช่น สุพรรณบุรี 1 สุพรรณบุรี 60 ปราจีนบุรี 1 พลายงาม ข้าวเจ้าหอมพิษณุโลก 1</p> \
                                <p class="indent">- ภาคเหนือ และตะวันออกเฉียงเหนือ เช่น ข้าวเจ้าหอมพิษณุโลก 1 สุรินทร์ 1 เหนียวอุบล 2 สันปาตอง 1 หางยี 71 กู้เมืองหลวง ขาวโป่งไคร้ น้ำรู</p> \
                                <p class="indent">- ภาคใต้ เช่น ดอกพะยอม</p> \
                                <p class="indent"><span class="bold">หว่านเมล็ดพันธุ์ในอัตราที่เหมาะสม</span> คือ 15-20 กิโลกรัม/ไร่ ควรแบ่งแปลงให้มีการระบายถ่ายเทอากาศดี และไม่ควรใส่ปุ๋ยไนโตรเจนสูงเกินไป ถ้าสูงถึง 50 กิโลกรัม/ไร่ โรคไหม้จะพัฒนาอย่างรวดเร็ว</p> \
                                <p class="indent"><span class="bold">คลุกเมล็ดพันธุ์ด้วยสารป้องกันกำจัดเชื้อรา</span> เช่น ไตรไซคลาโซล (tricyclazone) คาซูกาไมซิน (kasugamycin) คาร์เบนดาซิม (carbendazim) โพรคลอราซ ตามอัตราที่ระบุ</p> \
                                <p class="indent"><span class="bold">ในแหล่งที่เคยมีโรคระบาดและพบแผลโรคไหม้ทั่วไป 5 เปอร์เซ็นต์ ของพื้นที่ใบ (ในภาพรวม พบเฉลี่ย 2-3 แผลต่อใบ)</span> ควรฉีดพ่นสารป้องกันกำจัดเชื้อรา เช่น ไตรไซคลาโซล (tricyclazone) คาซูกาไมซิน (kasugamycin) อีดิเฟนฟอส ไอโซโพรไทโอเลน (isoprothiolane) คาร์เบนดาซิม (carbendazim) ตามอัตราที่ระบุ</p>'
                            ,unsafe_allow_html=True)
                    with tab5a:
                        st.markdown('<p class="indent"> ข้าวพันธุ์สุพรรณบุรี 1 สุพรรณบุรี 60 และชัยนาท 1 ที่ปลูกในภาคเหนือตอนล่าง พบว่าแสดงอาการรุนแรงในบางพื้นที่ และบางปี โดยเฉพาะเมื่อสภาพแวดล้อมเอื้ออำนวย เช่น ฝนพรำ หรือหมอก น้ำค้างจัด อากาศเย็น ใส่ปุ๋ยมากเกินความจำเป็น หรือเป็นดินหลังน้ำท่วม </p>',unsafe_allow_html=True)
               
                #TODO โรคใบจุดสีน้ำตาล ---------------------------
                with tab2:
                    tab1b,tab2b,tab3b,tab4b= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                    with tab2b:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อรา Bipolaris oryzae Breda de Haan.</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">ภาคกลาง ภาคเหนือ ภาคตะวันตก ภาคตะวันออกเฉียงเหนือ และภาคใต้ พบมากในนาน้ำฝน นาชลประทาน</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1b:
                        st.image(Image.open('diseaseDataImage/โรคใบจุดสีน้ำตาล (1).jpeg').resize((300,300)))
                        st.markdown('<p class="indent">แผลที่ใบข้าว พบมากในระยะแตกกอมีลักษณะเป็นจุดสีน้ำตาล รูปกลมหรือรูปไข่ ขอบนอกสุดของแผลมีสีเหลือง มีขนาดเส้นผ่าศูนย์กลาง 0.5-1 มิลลิเมตร แผลที่มีการพัฒนาเต็มที่ขนาดประมาณ 1-2 x 4-10 มิลลิเมตร บางครั้งพบแผลไม่เป็นวงกลมหรือรูปไข่ แต่จะเป็นรอยเปื้อนคล้ายสนิมกระจัดกระจายทั่วไปบนใบข้าว แผลยังสามารถเกิดบนเมล็ดข้าวเปลือก(โรคเมล็ดด่าง) บางแผลมีขนาดเล็ก บางแผลอาจใหญ่คลุมเมล็ดข้าวเปลือก ทำให้เมล็ดข้าวเปลือกสกปรก เสื่อมคุณภาพ เมื่อนำไปสีข้าวสารจะหักง่าย</p>'
                            ,unsafe_allow_html=True
                        )
                                            
                    with tab3b:
                        st.markdown('<p class="indent">เกิดจากสปอร์ของเชื้อราปลิวไปตามลม และติดไปกับเมล็ด</p>',unsafe_allow_html=True)
                    with tab4b:
                        st.markdown('<p class="indent bold">ใช้พันธุ์ต้านทานที่เหมาะสมกับสภาพท้องที่ โดยเฉพาะพันธุ์ที่มีคุณสมบัติต้านทานโรคใบสีส้ม</p> \
                                <p class="indent">- ภาคกลาง ใช้พันธุ์ปทุมธานี 1</p> \
                                <p class="indent">- ภาคเหนือและภาคตะวันออกเฉียงเหนือ ใช้พันธุ์เหนียวสันป่าตอง และหางยี 71</p> \
                                <p class="indent"><span class="bold">ปรับปรุงดินโดยการไถกลบฟาง หรือเพิ่มความอุดมสมบูรณ์ดินโดยการปลูกพืชปุ๋ยสด หรือปลูกพืชหมุนเวียนเพื่อช่วยลดความรุนแรงของโรค</span></p> \
                                <p class="indent"><span class="bold">คลุกเมล็ดพันธุ์ก่อนปลูกด้วยสารป้องกันกำจัดเชื้อรา</span> เช่น แมนโคเซ็บ หรือคาร์เบนดาซิม+แมนโคเซ็บอัตรา 3 กรัม / เมล็ด 1 กิโลกรัม</p> \
                                <p class="indent"><span class="bold">ใส่ปุ๋ยโปแตสเซียมคลอไรด์ (0-0-60) อัตรา 5-10 กิโลกรัม / ไร่ ช่วยลดความรุนแรงของโรค</span></p> \
                                <p class="indent"><span class="bold">กำจัดวัชพืชในนา ดูแลแปลงให้สะอาด และใส่ปุ๋ยในอัตราที่เหมาะสม</span></p> \
                                <p class="indent"><span class="bold">ถ้าพบอาการของโรคใบจุดสีน้ำตาลรุนแรงทั่วไป 10 เปอร์เซ็นต์ของพื้นที่ใบในระยะข้าวแตกกอ หรือในระยะที่ต้นข้าวตั้งท้องใกล้ออกรวง</span> เมื่อพบอาการใบจุดสีน้ำตาลที่ใบธงในสภาพฝนตกต่อเนื่อง อาจทำให้เกิดโรคเมล็ดด่าง ควรพ่นด้วยสารป้องกันกำจัดเชื้อรา เช่น  อีดิเฟนฟอส คาร์เบนดาซิม\
                                    แมนโคเซ็บ หรือคาร์เบนดาซิม+แมนโคเซบ ตามอัตราที่ระบุ</p>'
                        ,unsafe_allow_html=True)                                   
                
                #TODO โรคใบขีดสีน้ำตาล ---------------------------
                with tab3:
                    tab1c,tab2c,tab3c,tab4c= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                    with tab2c:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อรา Cercospora oryzae I. Miyake</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">ภาคกลาง ภาคเหนือ ภาคตะวันตก ภาคตะวันออกเฉียงเหนือ และ ภาคใต้ ในนาน้ำฝน และ นาชลประทาน</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1c:
                        st.image(Image.open('diseaseDataImage/โรคใบขีดสีน้ำตาล.jpg').resize((300,300)))
                        st.markdown('<p class="indent">ลักษณะแผลที่ใบมีสีน้ำตาลเป็นขีดๆ ขนานไปกับเส้นใบข้าว มักพบในระยะข้าวแตกกอ แผลไม่กว้าง ตรงกลางเล็กและไม่มีรอยช้ำที่แผล ต่อมาแผลจะขยายมาติดกัน แผลจะมีมากตามใบล่างและปลายใบ ใบที่เป็นโรคจะแห้งตายจากปลายใบก่อน ต้นข้าวที่เป็นโรครุนแรงจะมีแผลสีน้ำตาลที่ข้อต่อใบได้เช่นกัน เชื้อนี้สามารถเข้าทำลายคอรวงทำให้คอรวงเน่าและหักพับได้</p>'
                            ,unsafe_allow_html=True
                        )
                                            
                    with tab3c:
                        st.markdown('<p class="indent">สปอร์ของเชื้อราสามารถปลิวไปกับลม และติดไปกับเมล็ด</p>',unsafe_allow_html=True)
                    with tab4c:
                        st.markdown('<p class="indent"><span class="bold">ใช้ปุ๋ยโปแตสเซียมคลอไรด์ (0-0-60) อัตรา 5-10 กิโลกรัมต่อไร่</span> สามารถช่วยลดความรุนแรงของโรคได้</p> \
                                <p class="indent"><span class="bold">ใช้พันธุ์ต้านทานที่เหมาะสมเฉพาะท้องที่</span> เช่นภาคใต้ใช้พันธุ์แก่นจันทร์ ดอกพะยอม</p> \
                                <p class="indent"><span class="bold">กรณีเกิดการระบาดของโรครุน</span>ให้ฉีดพ่นด้วยสารป้องกันกำจัดเชื้อรา เช่น คาร์เบ็นดาซิม</p>'
                        ,unsafe_allow_html=True)                                   
                
                #TODO โรคใบวงสีน้ำตาล ---------------------------
                with tab4:
                    tab1d,tab2d,tab3d,tab4d= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                    with tab2d:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อรา Rhynocosporium oryzae Hashioka&Yokogi</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">ภาคเหนือและภาคใต้ และ ข้าวนาสวน (นาปี) ภาคตะวันออกเฉียงเหนือ</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1d:
                        st.image(Image.open('diseaseDataImage/โรคใบวงสีน้ำตาล.jpeg').resize((300,300)))
                        st.markdown('<p class="indent">ระยะกล้าข้าวจะแสดงอาการไหม้ที่ปลายใบและมีสีน้ำตาลเข้ม ระยะแตกกออาการส่วนใหญ่จะเกิดบนใบ แต่มักจะเกิดแผลที่ปลายใบมากกว่าบริเวณอื่นๆของใบ แผลที่เกิดบนใบในระยะแรกมีลักษณะเป็นรอยช้ำ รูปไข่ยาวๆ แผลสีน้ำตาลปนเทา ขอบแผลสีน้ำตาลอ่อน จากนั้นแผลจะขยายใหญ่ขึ้นเป็นรูปวงรีติดต่อกันทำให้เกิดอาการใบไหม้บริเวณกว้าง และเปลี่ยนเป็นสีฟางข้าว ในที่สุดแผลจะมีลักษณะเป็นวงซ้อนๆกันลุกลามเข้ามาที่โคนใบ มีผลทำให้ข้าวแห้งก่อนกำหนด</p>'
                            ,unsafe_allow_html=True
                        )
                                            
                    with tab3d:
                        st.markdown('<p class="indent">มีพืชอาศัยของเชื้อรา เช่น หญ้าชันกาด และหญ้าขน</p>',unsafe_allow_html=True)
                    with tab4d:
                        st.markdown('<p class="indent"><span class="bold">กำจัดพืชอาศัยของเชื้อราสาเหตุโรค</p> \
                                <p class="indent"><span class="bold">ใช้พันธุ์ต้านทานที่เหมาะสมเฉพาะท้องที่</span> เช่นภาคตะวันออกเฉียงเหนือใช้ หางยี 71</p> \
                                <p class="indent"><span class="bold">ในแหล่งที่เคยมีการระบาด หรือพบโรคจำนวนมาก</span>ให้ฉีดพ่นด้วยสารป้องกันกำจัดโรคพืช เช่น ไธโอฟาเนทเมทิล โพรพิโคนาโซล ตามอัตราที่ระบุ</p>'
                        ,unsafe_allow_html=True)                                   
                
                #TODO โรคกาบใบแห้ง ---------------------------
                with tab5:
                    tab1e,tab2e,tab3e,tab4e= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                    with tab2e:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อรา Rhizoctonia solani (Thanatephorus cucumeris (Frank) Donk)</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">ภาคกลาง ภาคเหนือ และ ภาคใต้ พบมาก ในนาชลประทาน</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1e:
                        st.image(Image.open('diseaseDataImage/โรคกาบใบแห้ง (1).jpeg').resize((300,300)))
                        st.markdown('<p class="indent">เริ่มพบโรคในระยะแตกกอจนถึงระยะใกล้เก็บเกี่ยว ยิ่งต้นข้าวมีการแตกกอมากเท่าใด ต้นข้าวก็จะเบียดเสียดกันมากขึ้น โรคก็จะเป็นรุนแรง ลักษณะแผลสีเขียวปนเทา ขนาดประมาณ 1-4 x 2-10 มิลลิเมตร ปรากฏตามกาบใบ ตรงบริเวณใกล้ระดับน้ำ แผลจะลุกลามขยายใหญ่ขึ้นจนมีขนาดไม่จำกัดและลุกลามขยายขึ้นถึงใบข้าว ถ้าเป็นพันธุ์ข้าวที่อ่อนแอ แผลสามารถลุกลามถึงใบธงและกาบหุ้มรวงข้าว ทำให้ใบและกาบใบเหี่ยวแห้ง ผลผลิตจะลดลงอย่างมากมาย</p>'
                            ,unsafe_allow_html=True
                        )
                                            
                    with tab3e:
                        st.markdown('<p class="indent">เชื้อราสามารถสร้างเม็ดขยายพันธุ์อยู่ได้นานในตอซังหรือวัชพืชในนาตามดินนา และมีชีวิตข้ามฤดูหมุนเวียนทำลายข้าวได้ตลอดฤดูการทำนา</p>',unsafe_allow_html=True)
                    with tab4e:
                        st.markdown('<p class="indent"><span class="bold">หลังเก็บเกี่ยวข้าว และเริ่มฤดูใหม่</span> ควรพลิกไถหน้าดินตากแดดเพื่อทำลายเม็ดขยายพันธุ์ของเชื้อราสาเหตุโรค</p> \
                                <p class="indent"><span class="bold">กำจัดวัชพืชตามคันนาและแหล่งน้ำ</span>เพื่อลดโอกาศการฟักตัวและเป็นแหล่งสะสมของเชื้อราสาเหตุโรค</p>\
                                <p class="indent"><span class="bold">ใช้ชีวภัณฑ์บาซิลลัส ซับทิลิส (เชื้อแบคทีเรียปฏิปักษ์) ในอัตราที่ระบุ</span></p>\
                                <p class="indent"><span class="bold">ใช้สารป้องกันกำจัดเชื้อรา</span>เช่น โพรพิโคนาโซล เพนไซคูรอน (25%ดับบลิวพี) หรืออีดิเฟนเฟอส ตามอัตราที่ระบุโดยพ่นสารป้องกันกำจัดเชื้อรานี้ในบริเวณที่เริ่มพบโรคระบาด ไม่จำเป็นต้องพ่นทั้งแปลง เพราะโรคกาบใบแห้งจะเกิดเป็นหย่อมๆ</p>'
                            ,unsafe_allow_html=True)
                
                #TODO โรคกาบใบเน่า ---------------------------
                with tab6:
                    tab1e,tab2e,tab3e,tab4e= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                    with tab2e:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อรา Sarocladium oryzae Sawada</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">ถาคกลางในนาชลประทาน</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1e:
                        st.image(Image.open('diseaseDataImage/โรคกาบใบเน่า (2).jpeg').resize((300,300)))
                        st.markdown('<p class="indent">ข้าวแสดงอาการในระยะตั้งท้องโดยเกิดแผลสีน้ำตาลดำบนกาบห่อรวง ขนาดแผลประมาณ 2-7 x 4-18 มิลลิเมตร ตรงกลางแผลมีกลุ่มเส้นใยสีขาวอมชมพู แผลนี้จะขยายติดต่อกันทำให้บริเวณกาบหุ้มรวงมีสีน้ำตาลดำและรวงข้าวส่วนใหญ่โผล่ไม่พ้นกาบหุ้มรวง หรือโผล่ได้บางส่วน ทำให้เมล็ดลีบและมีสีดำ</p>'
                            ,unsafe_allow_html=True
                        )
                                            
                    with tab3e:
                        st.markdown('<p class="indent">เชื้อรานี้ติดอยู่บนเมล็ดได้นาน นอกจากนี้ พบว่า “ไรขาว” ซึ่งอาศัยดูดกินน้ำเลี้ยงต้นข้าวในบริเวณกาบใบด้านใน สามารถเป็นพาหะช่วยทำให้โรคแพร่ระบาดได้รุนแรง และกว้างขวางยิ่งขึ้น</p>',unsafe_allow_html=True)
                    with tab4e:
                        st.markdown('<p class="indent"><span class="bold">ใช้สารป้องกันกำจัดเชื้อรา เช่น แมนโคเซ็บ ตามอัตราที่ระบุ</p> \
                                <p class="indent"><span class="bold">ใช้พันธุ์ค่อนข้างต้านทานที่เหมาะสมกับสภาพท้องที่</span> เช่น กข27 สำหรับนาลุ่มมีน้ำขัง ใช้พันธุ์ข้าวที่ลำต้นสูง แตกกอน้อย</p> \
                                <p class="indent"><span class="bold">ลดจำนวนประชากรไรขาว พาหะแพร่เชื้อ ในช่วงอากาศแห้งแล้ง ด้วยสารกำจัดไร</span>เช่น ไตรไทออน โอไมท์ ตามอัตราที่ระบุ</p>'
                        ,unsafe_allow_html=True)                                   
                
                #TODO โรคเมล็ดด่าง ---------------------------
                with tab7:
                    tab1f,tab2f,tab3f,tab4f= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                    with tab2f:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อรา 6 ชนิดได้แก่</p> \
                                    <p class="indent">Curvularia lunata (Wakk) Boed.</p> \
                                    <p class="indent">Cercospora oryzae I.Miyake.</p> \
                                    <p class="indent">Bipolaris oryzae Breda de Haan.</p> \
                                    <p class="indent">Fusarium semitectum Berk & Rav.</p> \
                                    <p class="indent">Trichoconis padwickii Ganguly.</p> \
                                    <p class="indent">Sarocladium oryzae Sawada.</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">ภาคกลาง ภาคตะวันตก ภาคเหนือ ภาคตะวันออกเฉียงเหนือ และ ภาคใต้ ในนาชลประทาน</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1f:
                        st.image(Image.open('diseaseDataImage/โรคเมล็ดด่าง (2).jpeg').resize((300,300)))
                        st.markdown('<p class="indent">ในระยะออกรวง พบแผลสีต่างๆ เช่นเป็นจุดสีน้ำตาลหรือดำหรือมีลายสีน้ำตาลดำหรือสีเทาปนชมพูที่เมล็ดบนรวงข้าว ทั้งนี้เพราะมีเชื้อราหลายชนิดที่สามารถเข้าทำลายและทำให้เกิดอาการต่างกันไป การเข้าทำลายของเชื้อรามักจะเกิดในช่วงดอกข้าวเริ่มโผล่จากกาบหุ้มรวงจนถึงระยะเมล็ดข้าวเริ่มเป็นน้ำนม และอาการเมล็ดด่าง จะปรากฏเด่นชัดในระยะใกล้เก็บเกี่ยว</p>'
                            ,unsafe_allow_html=True
                        )
                                            
                    with tab3f:
                        st.markdown('<p class="indent">เชื้อราสามารถแพร่กระจายไปกับลม ติดไปกับเมล็ด และสามารถแพร่กระจายในยุ้งฉางได้</p>',unsafe_allow_html=True)
                    with tab4f:
                        st.markdown('<p class="indent"><span class="bold">คัดเลือกเมล็ดพันธ์ที่ปราศจากโรคมาใช้ในการปลูกข้าว</p> \
                                <p class="indent"><span class="bold">เฝ้าระวังการเกิดโรคหากปลูกข้าวพันธ์ุที่อ่อนแอต่อโรคนี้</span> เช่น สุพรรณบุรี 60,สุพรรณบุรี 90,พิษณุโลก 2 และข้าวเจ้าหอมคลองหลวง 1</p> \
                                <p class="indent"><span class="bold">คลุกเมล็ดพันธุ์ด้วยสารป้องกันกำจัดเชื้อร</span> เช่น แมนโคเซบ ในอัตรา 3 กรัม /เมล็ดพันธุ์ 1 กิโลกรัม</p> \
                                <p class="indent"><span class="bold">ในระยะที่ข้าวตั้งท้องใกล้ออกรวง</span>ถ้าพบการระบาดของโรคใบจุดสีน้ำตาลที่ใบธง และโรคกาบใบเน่า ถ้ามีฝนตกชุกควรวางมาตราการป้องกันโดยพ่นสารป้องกันกำจัดเชื้อราเช่น โพรพิโคนาโซล+ไดฟีโนโคนาโซล หรือ โพรพิโคนาโซล+โพรคลอราซ</p>'
                        ,unsafe_allow_html=True)                                   

                #TODO โรคถอดฝักดาบ ---------------------------
                with tab8:
                    tab1g,tab2g,tab3g,tab4g= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                    with tab2g:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อรา Fusarium fujikuroi Nirenberg</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">พบทั่วทุกภาคของประเทศไทย</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1g:
                        st.image(Image.open('diseaseDataImage/Bakanae Disease.jpg').resize((300,300)))
                        st.markdown('<p class="indent">พบโรคในระยะกล้าถ้าอาการรุนแรงต้นกล้าจะแห้งตายหลังปลูกได้ไม่เกิน 7 วัน แต่มักพบกับข้าวอายุเกิน 15 วัน ระยะเริ่มแตกกอ ข้าวเป็นโรคจะต้นผอมสูงเด่นกว่ากล้าข้าวโดยทั่ว ๆ ไป ต้นข้าวผอมมีสีเขียวอ่อนซีด มักย่างปล้อง บางกรณีข้าวจะไม่ย่างปล้อง แต่รากจะเน่าช้ำเวลาถอนมักจะขาดตรงบริเวณโคนต้น หากไม่รุนแรงอาการจะแสดงหลังจากย้ายไปปักดำได้ 15-45 วัน โดยที่ต้นเป็นโรคจะสูงกว่าข้าวปกติ ใบมีสีเขียวซีด เกิดรากแขนงที่ข้อลำต้นตรงระดับน้ำ บางครั้งพบกลุ่มเส้นใยสีชมพูตรงบริเวณข้อที่ย่างปล้องขึ้นมา ต้นข้าวที่เป็นโรคมักจะตายและมีน้อยมากที่อยู่รอดจนถึงออกรวง</p>'
                            ,unsafe_allow_html=True
                        )
                                            
                    with tab3g:
                        st.markdown('<p class="indent">เชื้อราจะติดไปกับเมล็ด สามารถมีชีวิตในซากต้นข้าวและในดินได้เป็นเวลาหลายเดือนพบว่า หญ้าชันกาด เป็นพืชอาศัยของโรค</p>',unsafe_allow_html=True)
                    with tab4g:
                        st.markdown('<p class="indent"><span class="bold">หลีกเลี่ยงการนำเมล็ดพันธุ์จากแหล่งที่เคยเป็นโรคระบาดมาปลูก</p> \
                                <p class="indent"><span class="bold">คลุกเมล็ดพันธุ์ข้าวด้วยสารป้องกันกำจัดเชื้อรา</span> เช่น แมนโคเซ็บ อัตรา 3 กรัมต่อเมล็ด 1 กิโลกรัม หรือแช่เมล็ดข้าวเปลือกก่อนหุ้มข้าวให้งอกก่อนปลูก ด้วยสารละลายของสารป้องกันกำจัดเชื้อราดังกล่าวในอัตรา 30 กรัมต่อน้ำ 20 ลิตร หรือแช่เมล็ดข้าวในสารละลายโซเดียมคลอโรไฮโปคลอไรท์ (คลอร็อกซ์)ความเข้มข้น 5 เปอร์เซ็นต์หรือ คลอร็อกซ์ อัตรา 1 : น้ำ 9 ส่วน</p> \
                                <p class="indent"><span class="bold">คลุกเมล็ดพันธุ์ด้วยสารป้องกันกำจัดเชื้อร</span> เช่น แมนโคเซบ ในอัตรา 3 กรัม /เมล็ดพันธุ์ 1 กิโลกรัม</p> \
                                <p class="indent"><span class="bold">ควรกำจัดต้นข้าวที่เป็นโรคโดยการถอนและเผาทิ้ง เนื่องจากสปอร์ของเชื้อราสามารถปลิวไปตกบนรวงข้าวอื่น</p>'
                        ,unsafe_allow_html=True)                                   
                
                #TODO โรคกล้าเน่า ---------------------------
                with tab9:
                    tab1i,tab2i,tab3i,tab4i= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                    with tab2i:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อรา Curvularia lunata (Wakk.) Board.</p> \
                                    <p class="indent">พบมากในกระบะตกกล้าที่ใช้กับรถปักดำ ในพื้นที่ที่ใช้เครื่องปักดำข้าว</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1i:
                        st.image(Image.open('diseaseDataImage/seedling rot2.jpg').resize((300,300)))
                        st.markdown('<p class="indent">เริ่มพบอาการได้ในระยะหลังจากการตกกล้าข้าวในกระบะเพาะโดยจะเริ่มพบเมล็ดข้าวบางส่วนที่เพาะไม่งอกและมีเส้นใยของเชื้อราปกคลุม  ส่วนเมล็ดที่งอกต้นกล้าจะมีการเจริญเติบโตช้ากว่าต้นกล้าข้าวปกติ และเมื่อถอนต้นกล้าข้าวขึ้นมาดู ก็จะพบส่วนรากและโคนต้นกล้ามีแผลสีน้ำตาล และแผลที่เกิดบนโคนต้นจะลุกลามขึ้นไปยังส่วนบนของต้นกล้า  ต่อจากนั้นจะทำให้ต้นกล้าเน่าตาย ในขณะเดียวกันเชื้อราสาเหตุของโรคจะขยายจากจุดเริ่มต้นที่เป็นโรคออกไปบริเวณโดยรอบไปยังต้นกล้าข้างเคียง โดยในกรณีที่มีการตกกล้าที่หนาแน่นเชื้อราสาเหตุของโรคสามารถแพร่กระจายไปยังส่วนอื่นๆของกระบะเพาะได้อย่างรวดเร็ว ต่อจากนี้ก็จะพบอาการตายของต้นกล้าข้าวเป็นหย่อมๆ  กรณีที่เป็นโรคในกระบะกล้ารุนแรงทำให้ไม่สามารถนำต้นกล้าข้าวนั้นไปใช้ปักดำได้</p>'
                            ,unsafe_allow_html=True
                        )
                    with tab3i:
                        st.markdown('<p class="indent">โดยการใช้เมล็ดพันธุ์ที่เป็นโรคเมล็ดด่างมาทำการตกกล้า</p>',unsafe_allow_html=True)
                    with tab4i:
                        st.markdown('<p class="indent"><span class="bold">ไม่ควรใช้เมล็ดพันธุ์จากแปลงที่มีการระบาดของโรคเมล็ดด่างมาก่อน</span></p> \
                                <p class="indent"><span class="bold">คลุกเมล็ดพันธุ์ก่อนปลูกด้วยสารป้องกันกำจัดโรคพืช</span> เช่น คาร์เบนดาซิม + แมนโคเซบ ในอัตรา 3 กรัมต่อเมล็ดพันธุ์ 1 กิโลกรัม</p> \
                                <p class="indent"><span class="bold">ล้างทำความสะอาดกระบะเพาะกล้าหลังใช้ด้วยน้ำยาฆ่าเชื้อ</span></p> \
                                <p class="indent"><span class="bold">เผาทำลายต้นกล้าข้าวที่เป็นโรคเน่าตายในกระบะเพาะ</span></p>'
                            ,unsafe_allow_html=True)   

                #TODO โรคลำต้นเน่า ---------------------------
                with tab10:
                    tab1j,tab2j,tab3j,tab4j= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                    with tab2j:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อรา Curvularia lunata (Wakk.) Board.</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">ภาคกลาง ภาคเหนือ ภาคตะวันออกเฉียงเหนือ  และภาคใต้ ในนาน้ำฝน และนาชลประทา</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1j:
                        st.image(Image.open('diseaseDataImage/โรคลำต้นเน่า.jpg').resize((300,300)))
                        st.markdown('<p class="indent">เริ่มพบอาการได้ในระยะต้นข้าวก่อนออกรวงหรือหลังออกรวงแล้ว โดยจะพบแผลเป็นจุดสีน้ำตาลดำใกล้ระดับน้ำและแผลจะขยายใหญ่ขึ้นและลงตามกาบใบของต้นข้าว และในขณะเดียวกันภายในลำต้นก็จะมีแผลมีลักษณะเป็นขีดสีน้ำตาล เมื่อต้นข้าวเป็นโรครุนแรง ใบล่างของต้นข้าวเปลี่ยนเป็นสีเหลือง ส่วนของกาบใบและลำต้นจะเน่า ต้นข้าวล้มง่ายและเมื่อดึงต้นข้าวก็จะหลุดออกจากกอได้ง่าย ต้นข้าวจะตายก่อนออกรวง แต่ถ้ามีการระบาดของโรคไม่รุนแรงหรือโรคเกิดขึ้นในระยะต้นข้าวหลังออกรวงแล้ว จะมีผลทำให้ผลผลิตของข้าวลดลงได้ และเมื่อต้นข้าวเป็นโรคและแห้งตายก็จะพบเม็ดขยายพันธุ์ของเชื้อราสาเหตุของโรคมีสีดำฝังอยู่ในเนื้อเยื่อของกาบใบและตามปล้องของต้นข้าว เม็ดขยายพันธุ์ของเชื้อราสาเหตุของโรคสามารถตกค้างอยู่บนตอซังข้าวและในดินได้เป็นระยะเวลานาน</p>'
                            ,unsafe_allow_html=True
                        )
                    with tab3j:
                        st.markdown('<p class="indent">เนื่องจากเชื้อราสาเหตุจะสร้างเม็ดขยายพันธุ์ที่ตกค้างอยู่ในตอซังข้าวและดิน ในขณะเดียวกันก็สามารถลอยอยู่บนผิวน้ำและแพร่กระจายไปกับน้ำในนาข้าวได้เช่นกัน</p>',unsafe_allow_html=True)
                    with tab4j:
                        st.markdown('<p class="indent"><span class="bold">ไม่ควรใส่ปุ๋ยไนโตรเจนสูงในแปลงที่เป็นโรค </span></p> \
                                <p class="indent"><span class="bold">หลังเก็บเกี่ยวข้าว และเริ่มฤดูใหม่ ควรพลิกไถหน้าดิน</span>เพื่อทำลายเม็ดขยายพันธุ์ของเชื้อรา เก็บทำลายซากพืชที่เป็นโรคออกจากแปลง</p> \
                                <p class="indent"><span class="bold">หมั่นตรวจแปลงอย่างสม่ำเสมอ</span>เมื่อเริ่มพบโรคพ่นด้วยสารป้องกันกำจัดโรคพืช เช่น พีซีเอ็นบี คาร์บ๊อกซิน วาลิดามัยซิน</p>'
                            ,unsafe_allow_html=True)   
                #--------------------------------------------------

            #* เชื้อแบคทีเรีย ------------------
            with st.expander('เชื้อแบคทีเรีย'):
                tab1k,tab2k = st.tabs([
                    'โรคใบขีดโปร่งแสง','โรคขอบใบแห้ง'
                ])
                #TODO โรคใบขีดโปร่งแสง ---------------------------
                with tab1k:
                    tab1m,tab2m,tab3m,tab4m= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                    with tab2m:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อแบคทีเรีย Xanthomonas oryzae pv. oryzicola (Fang et al.) Swings et al.</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">ภาคกลาง ภาคตะวันออกเฉียงเหนือ และ ภาคใต้ พบมากในนาน้ำฝน นาชลประทาน</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1m:
                        st.image(Image.open('diseaseDataImage/โรคใบขีดโปร่งแสง1 1.jpg').resize((300,300)))
                        st.markdown('<p class="indent">โรคนี้เป็นได้ตั้งแต่ระยะข้าวแตกกอจนถึงออกรวง อาการปรากฏที่ใบ เริ่มแรกเห็นเป็นขีดช้ำยาวไปตามเส้นใบ ต่อมาค่อยๆ เปลี่ยนเป็นสีเหลืองหรือส้ม เมื่อแผลขยายรวมกันก็จะเป็นแผลใหญ่ แสงสามารถทะลุผ่านได้ และพบแบคทีเรียในรูปหยดน้ำสีเหลืองคล้ายยางสนกลมๆ ขนาดเล็กเท่าหัวเข็มหมุดปรากฏอยู่บนแผล ความยาวของแผลขึ้นอยู่กับความต้านทานของพันธุ์ข้าว และความรุนแรงของเชื้อ ในพันธุ์ที่อ่อนแอต่อโรค แผลจะขยายจนใบไหม้ไปถึงกาบใบ ลักษณะของแผลจะคล้ายคลึงกับเกิดบนใบ ส่วนในพันธุ์ต้านทาน จำนวนแผลจะน้อยและแผลจะไม่ขยายตามความยาวของใบ รอบๆ แผลจะมีสีน้ำตาลดำ</p>'
                            ,unsafe_allow_html=True
                        )
                                            
                    with tab3m:
                        st.markdown('<p class="indent">สภาพที่มีฝนตก ลมพัดแรง จะช่วยให้โรคแพร่ระบาดอย่างกว้างขวางรวดเร็ว</p>',unsafe_allow_html=True)
                    with tab4m:
                        st.markdown('<p class="indent"><span class="bold">ในดินที่อุดมสมบูรณ์ไม่ควรใส่ปุ๋ยไนโตรเจนมาก</span></p> \
                                <p class="indent"><span class="bold">ไม่ควรปลูกข้าวแน่นเกินไปและอย่าให้ระดับน้ำในนาสูงเกินควร</span></p>'
                            ,unsafe_allow_html=True)   
                    
                #TODO โรคขอบใบแห้ง ---------------------------
                with tab2k:
                    tab1l,tab2l,tab3l,tab4l= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                    with tab2l:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อแบคทีเรีย Xanthomonas oryzae pv. oryzae (ex Ishiyama) Swings et al.</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">ภาคเหนือ ภาคตะวันออกเฉียงเหนือ และภาคใต้ พบมากในนาน้ำฝน นาชลประทาน</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1l:
                        st.image(Image.open('diseaseDataImage/โรคขอบใบแห้ง.jpg').resize((300,300)))
                        st.markdown('<p class="indent">โรคนี้เป็นได้ตั้งแต่ระยะกล้า แตกกอ จนถึง ออกรวง ต้นกล้าก่อนนำไปปักดำจะมีจุดเล็กๆลักษณะช้ำที่ขอบใบของใบล่าง ต่อมาประมาณ 7-10 วัน จุดช้ำนี้จะขยายกลายเป็นทางสีเหลืองยาวตามใบข้าว ใบที่เป็นโรคจะแห้งเร็ว และสีเขียวจะจางลงเป็นสีเทาๆ อาการในระยะปักดำจะแสดงหลังปักดำแล้วหนึ่งเดือนถึงเดือนครึ่ง ใบที่เป็นโรคขอบใบมีรอยขีดช้ำ ต่อมาจะเปลี่ยนเป็นสีเหลือง ที่แผลมีหยดน้ำสีครีมคล้ายยางสนกลมๆขนาดเล็กเท่าหัวเข็มหมุด ต่อมาจะกลายเป็นสีน้ำตาลและหลุดไปตามลม น้ำหรือฝน ซึ่งจะทำให้โรคสามารถระบาดต่อไปได้ แผลจะขยายไปตามความยาวของใบ บางครั้งขยายเข้าไปข้างในตามความกว้างของใบ ขอบแผลมีลักษณะเป็นขอบลายหยัก แผลนี้เมื่อนานไปจะเปลี่ยนเป็นสีเทา ใบที่เป็นโรคขอบใบจะแห้งและม้วนตามความยาว ในกรณีที่ต้นข้าวมีความอ่อนแอต่อโรคและเชื้อโรคมีปริมาณมากเชื้อจะทำให้ท่อน้ำท่ออาหารอุดตัน ต้นข้าวจะเหี่ยวเฉาและแห้งตายทั้งต้นโดยรวดเร็ว เรียกอาการของโรคนี้ว่า ครีเสก (kresek)</p>'
                            ,unsafe_allow_html=True
                        )
                                            
                    with tab3l:
                        st.markdown('<p class="indent">เชื้อสาเหตุโรคสามารถแพร่ไปกับน้ำ ในสภาพแวดล้อมที่มีความชื้นสูง และสภาพที่มีฝนตก ลมพัดแรง จะช่วยให้โรคแพร่ระบาดอย่างกว้างขวางรวดเร็ว</p>',unsafe_allow_html=True)
                    with tab4l:
                        st.markdown('<p class="indent"><span class="bold">ใช้พันธุ์ข้าวที่ต้านทาน เช่น พันธุ์สุพรรณบุรี 60 สุพรรณบุรี 90 สุพรรณบุรี 1 สุพรรณบุรี 2 และ กข23</span></p> \
                                <p class="indent"><span class="bold">ในดินที่อุดมสมบูรณ์ไม่ควรใส่ปุ๋ยไนโตรเจนมาก</span></p> \
                                <p class="indent"><span class="bold">ไม่ควรระบายน้ำจากแปลงที่เป็นโรคไปสู่แปลงอื่น</span></p> \
                                <p class="indent"><span class="bold">ควรเฝ้าระวังการเกิดโรคถ้าปลูกข้าวพันธุ์ที่อ่อนแอต่อโรคนี้</span>เช่น พันธุ์ขาวดอกมะลิ 105 กข6 เหนียวสันป่าตอง พิษณุโลก 2  ชัยนาท 1 เมื่อเริ่มพบอาการของโรคบนใบข้าวให้ใช้สารป้องกันกำจัดโรคพืช เช่น ไอโซโพรไทโอเลน คอปเปอร์ไฮดรอกไซด์ เสตร็พโตมัยซินซัลเฟต+ออกซีเตทตราไซคลินไฮโดรคลอร์ไรด์ ไตรเบซิคคอปเปอร์ซัลเฟต</p>'
                            ,unsafe_allow_html=True)   

            #* เชื้อไวรัส ------------------
            with st.expander('เชื้อไวรัส'):
                tab1m,tab2m,tab3m,tab4m = st.tabs([
                    'โรคใบหงิก (โรคจู๋)','โรคเขียวเตี้ย','โรคใบสีส้ม','โรคหูด'
                ])
                #TODO โรคขอบใบหงิก ---------------------------
                with tab1m:
                    tab1n,tab2n,tab3n,tab4n= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                    with tab2n:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อไวรัส Rice Ragged Stunt Virus (RRSV)</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">ภาคกลาง และภาคเหนือตอนล่าง พบมากในนาชลประทาน</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1n:
                        st.image(Image.open('diseaseDataImage/โรคใบหงิก2 1.jpg').resize((300,300)))
                        st.markdown('<p class="indent">ต้นข้าวเป็นโรคได้ทั้ง ระยะกล้า แตกกอ ตั้งท้อง อาการของต้นข้าวที่เป็นโรคสังเกตได้ง่ายคือ ข้าวต้นเตี้ยกว่าปกติ ใบแคบและสั้นสีเขียวเข้ม แตกใบใหม่ช้ากว่าปกติ แผ่นใบไม่สมบูรณ์ ปลายใบบิดเป็นเกลียว ขอบใบแหว่งวิ่นและเส้นใบบวมโป่งเป็นแนวยาวทั้งที่ใบและกาบใบ ข้าวที่เป็นโรคออกรวงล่าช้าและให้รวงไม่สมบูรณ์ เมล็ดลีบ ผลผลิตลดลง 30 ถึง 70 เปอร์เซ็นต์ และข้าวพันธุ์อ่อนแอที่เป็นโรคในระยะกล้า ต้นข้าวอาจตายและไม่ได้ผลผลิตเลย</p>'
                            ,unsafe_allow_html=True
                        )
                                            
                    with tab3n:
                        st.image(Image.open('diseaseDataImage/เพลี้ยกระโดดสีน้ำตาล.jpeg').resize((300,300)))
                        st.markdown('<p class="indent">เชื้อไวรัสสาเหตุโรคถ่ายทอดได้โดยแมลงพาหะ คือ เพลี้ยกระโดดสีน้ำตาล และเชื้อไวรัสสามารถคงอยู่ในตอซัง และหญ้าบางชนิด</p>',unsafe_allow_html=True)
                    with tab4n:
                        st.markdown('<p class="indent"><span class="bold">กำจัดหรือทำลายเชื้อไวรัส โดยไถกลบหรือเผาตอซังในนาที่มีโรค กำจัดวัชพืช</span>โดยเฉพาะวัชพืชใกล้แหล่งน้ำซึ่งเป็นที่อยู่อาศัยและขยายพันธุ์ของแมลงพาหะ</p> \
                                <p class="indent"><span class="bold">ใช้พันธุ์ที่ต้านทานต่อเพลี้ยกระโดดสีน้ำตาล</span>เช่น พันธุ์สุพรรณบุรี 90 สุพรรณบุรี 3 และชัยนาท 2 แต่ไม่ควรปลูกข้าวพันธุ์ดังกล่าว ติดต่อกันเป็นแปลงขนาดใหญ่ เนื่องจากแมลงสามารถปรับตัวเข้าทำลายพันธุ์ข้าวที่ต้านทานได้</p> \
                                <p class="indent"><span class="bold">ใช้สารป้องกันกำจัดแมลงพาหะ</span>ได้แก่ ใช้สารฆ่าแมลงในระยะที่แมลงเป็นตัวอ่อน เช่น ไดโนทีฟูเรน หรือ บูโพรเฟซิน หรือ อีโทเฟนพรอกซ์ ไม่ควรใช้สารฆ่าแมลงผสมกันหลายๆ ชนิดหรือใช้สารฆ่าแมลงผสมสารป้องกันกำจัดโรคพืชหรือสารกำจัดวัชพืช เพราะอาจทำให้ประสิทธิภาพของสารฆ่าแมลงลดลง</p> \
                                <p class="indent"><span class="bold">ไม่ใช้สารกลุ่มไพรีทรอยด์สังเคราะห์</span>เช่น ไซเพอร์มิทริน ไซฮาโลทริน เดลต้ามิทริน เนื่องจากสารกลุ่มนี้ไปทำลายแมลงศัตรูธรรมชาติ จึงทำให้เกิดการระบาดรุนแรงของเพลี้ยกระโดดสีน้ำตาล</p> \
                                 <p class="indent"><span class="bold">ถ้าปฏิบัติได้ เมื่อมีโรคระบาดรุนแรงควรงดปลูกข้าว 1–2 ฤดู เพื่อตัดวงจรชีวิตของแมลงพาหะ</span></p>'
                            ,unsafe_allow_html=True)   

                #TODO โรคเขียวเตี้ย ---------------------------
                with tab2m:
                    tab1o,tab2o,tab3o,tab4o= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                    with tab2o:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อไวรัส Rice Grassy Stunt Virus (RGSV)</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">ภาคกลาง พบมากในนาชลประทาน</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1o:
                        st.image(Image.open('diseaseDataImage/rice_grassy stunt-05-014.jpg').resize((300,300)))
                        st.markdown('<p class="indent">ต้นข้าวเป็นโรคได้ ทั้งระยะกล้า แตกกอ ตั้งท้อง ต้นข้าวที่เป็นโรคนี้ต้นจะเตี้ยแคระแกรน เป็นพุ่มแจ้ แตกกอมาก ใบแคบสีเหลือง เหลืองอมเขียวจนถึงเหลืองอ่อน พบว่าใบมีจุดประสีเหลืองอ่อนจนถึงน้ำตาลอ่อน  บางครั้งพบแถบสีเขียวเหลืองระหว่างเส้นใบขนานไปกับเส้นกลางใบ ต้นข้าวที่เป็นโรคมักจะไม่ออกรวง หรือให้รวงไม่สมบูรณ์ บางครั้งอาจพบโรคนี้เกิดร่วมกับโรคใบหงิก แต่ไม่พบการระบาดกว้างขางเหมือนโรคใบหงิก</p>'
                            ,unsafe_allow_html=True
                        )
                                            
                    with tab3o:
                        st.image(Image.open('diseaseDataImage/เพลี้ยกระโดดสีน้ำตาล.jpeg').resize((300,300)))
                        st.markdown('<p class="indent">เชื้อไวรัสสาเหตุโรคถ่ายทอดได้โดยแมลงพาหะ คือ เพลี้ยกระโดดสีน้ำตาล</p>',unsafe_allow_html=True)
                    with tab4o:
                        st.markdown('<p class="indent"><span class="bold">กำจัดหรือทำลายเชื้อไวรัส โดยไถกลบหรือเผาตอซังในนาที่มีโรค กำจัดวัชพืช</span>โดยเฉพาะวัชพืชใกล้แหล่งน้ำซึ่งเป็นที่อยู่อาศัยและขยายพันธุ์ของแมลงพาหะ</p> \
                                <p class="indent"><span class="bold">ใช้พันธุ์ที่ต้านทานต่อเพลี้ยกระโดดสีน้ำตาล</span>เช่น พันธุ์สุพรรณบุรี 90 สุพรรณบุรี 3 และชัยนาท 2 แต่ไม่ควรปลูกข้าวพันธุ์ดังกล่าว ติดต่อกันเป็นแปลงขนาดใหญ่ เนื่องจากแมลงสามารถปรับตัวเข้าทำลายพันธุ์ข้าวที่ต้านทานได้</p> \
                                <p class="indent"><span class="bold">ใช้สารป้องกันกำจัดแมลงพาหะ</span>ได้แก่ ใช้สารฆ่าแมลงในระยะที่แมลงเป็นตัวอ่อน เช่น ไดโนทีฟูเรน หรือ บูโพรเฟซิน หรือ อีโทเฟนพรอกซ์ ไม่ควรใช้สารฆ่าแมลงผสมกันหลายๆ ชนิดหรือใช้สารฆ่าแมลงผสมสารป้องกันกำจัดโรคพืชหรือสารกำจัดวัชพืช เพราะอาจทำให้ประสิทธิภาพของสารฆ่าแมลงลดลง</p> \
                                <p class="indent"><span class="bold">ไม่ใช้สารกลุ่มไพรีทรอยด์สังเคราะห์</span>เช่น ไซเพอร์มิทริน ไซฮาโลทริน เดลต้ามิทริน เนื่องจากสารกลุ่มนี้ไปทำลายแมลงศัตรูธรรมชาติ จึงทำให้เกิดการระบาดรุนแรงของเพลี้ยกระโดดสีน้ำตาล</p> \
                                 <p class="indent"><span class="bold">ถ้าปฏิบัติได้ เมื่อมีโรคระบาดรุนแรงควรงดปลูกข้าว 1–2 ฤดู เพื่อตัดวงจรชีวิตของแมลงพาหะ</span></p>'
                            ,unsafe_allow_html=True)   

                #TODO โรคใบสีส้ม ---------------------------
                with tab3m:
                    tab1p,tab2p,tab3p,tab4p= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                    with tab2p:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อไวรัส Rice Tungro Bacilliform Virus (RTBV) และ Rice Tungro Spherical Virus (RTSV)</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">ภาคกลาง และภาคเหนือตอนล่าง พบมากในนาชลประทาน</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1p:
                        st.image(Image.open('diseaseDataImage/โรคใบสีส้ม.jpg').resize((300,300)))
                        st.markdown('<p class="indent">ต้นข้าวเป็นโรคได้ ทั้งระยะกล้า แตกกอ ตั้งท้อง หากข้าวได้รับเชื้อตอนข้าวอายุอ่อน (ระยะกล้าถึงระยะแตกกอ) ข้าวจะเสียหายมากกว่าได้รับเชื้อตอนอายุแก่ (ระยะตั้งท้องถึงระยะออกรวง) ข้าวเริ่มแสดงอาการหลังจากได้รับเชื้อ 15-20 วัน ทั้งนี้แล้วแต่ว่าข้าวจะได้รับเชื้อระยะใด อาการเริ่มต้นใบข้าวจะเริ่มมีสีเหลืองสลับเขียว ต่อมาจะเปลี่ยนเป็นสีเหลือง เริ่มจากปลายใบเข้าหาโคนใบ ถ้าเป็นรุนแรงในระยะกล้าต้นข้าวอาจถึงตาย ต้นที่เป็นโรคจะเตี้ยแคระแกรน ช่วงลำต้นสั้นกว่าปกติมาก ใบใหม่ที่โผล่ออกมามีตำแหน่งต่ำกว่าข้อต่อใบล่าสุด ถ้าเป็นรุนแรงอาจตายทั้งกอ ถ้าไม่ตายจะออกรวงล่าช้ากว่าปกติ ให้รวงเล็ก หรือไม่ออกรวงเลย</p>'
                            ,unsafe_allow_html=True
                        )
                                            
                    with tab3p:
                        st.image(Image.open('diseaseDataImage/tungro_insect.jpeg').resize((300,300)))
                        st.markdown('<p class="indent">แพร่ระบาดได้โดยเพลี้ยจักจั่นสีเขียวซึ่งเป็นแมลงพาหะ</p>',unsafe_allow_html=True)
                    with tab4p:
                        st.markdown('<p class="indent"><span class="bold">ใช้พันธุ์ข้าวต้านทานแมลงเพลี้ยจักจั่นสีเขียว เช่น กข1 กข3</span></p> \
                                <p class="indent"><span class="bold">กำจัดวัชพืช และพืชอาศัยของเชื้อไวรัสและแมลงพาหะนำโรค</span></p>\
                                <p class="indent"><span class="bold">ใช้สารป้องกันกำจัดแมลงพาหะ</span> ได้แก่ สารฆ่าแมลงในระยะที่แมลงเป็นตัวอ่อน เช่น ไดโนทีฟูเรน หรือ บูโพรเฟซิน หรือ อีโทเฟนพรอกซ์ ไม่ควรใช้สารฆ่าแมลงผสมกันหลายๆ ชนิด หรือใช้สารฆ่าแมลงผสมสารกำจัดโรคพืชหรือสารกำจัดวัชพืช เพราะอาจทำให้ประสิทธิภาพของสารฆ่าแมลงลดลง ไม่ใช้สารกลุ่มไพรีทรอยด์สังเคราะห์ เช่น ไซเพอร์มิทริน ไซฮาโลทริน เดลต้ามิทริน</p>'
                            ,unsafe_allow_html=True)
                
                #TODO โรคหูด ---------------------------
                with tab4m:
                    tab1q,tab2q,tab3q,tab4q= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                    with tab2q:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อไวรัส Rice Gall Dwarf Virus (RGDV)</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">ภาคกลาง พบมากในนาชลประทาน</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1q:
                        st.image(Image.open('diseaseDataImage/โรคหูด.jpeg').resize((300,300)))
                        st.markdown('<p class="indent">ต้นข้าวเป็นโรคได้ ตั้งแต่ระยะกล้า จนถึงระยะตั้งท้อง อาการของโรคคล้ายคลึงโรคใบหงิกมาก คือ ข้าวต้นเตี้ย แคระแกร็น ใบสีเขียวเข้มและสั้นกว่าปกติ นอกจากนี้ที่บริเวณหลังและกาบใบปรากฏปมขนาดเล็ก สีเขียวซีดหรือขาวใส ลักษณะคล้ายเม็ดหูด ซึ่งเป็นเส้นใบที่บวมปูดออกมาจะปรากฏเด่นชัด และมีจำนวนเม็ดหูดเพิ่มมากขึ้นเมื่อต้นข้าวแสดงอาการรุนแรง ต้นข้าวที่เป็นโรคจะแตกกอน้อยให้รวงไม่สมบูรณ์</p>'
                            ,unsafe_allow_html=True
                        )
                                            
                    with tab3q:
                        st.image(Image.open('diseaseDataImage/เพลี้ยจักจั่นปีกลายหยัก.jpeg').resize((300,300)))
                        st.markdown('<p class="indent">เชื้อไวรัสสาเหตุโรคถ่ายทอดได้โดยแมลงพาหะ คือ เพลี้ยจักจั่นปีกลายหยัก และ เพลี้ยจักจั่นสีเขียว</p>',unsafe_allow_html=True)
                    with tab4q:
                        st.markdown('<p class="indent"><span class="bold">กำจัดหรือทำลายเชื้อไวรัส โดยไถกลบหรือเผาตอซังในนาที่มีโรค กำจัดวัชพืช</span>โดยเฉพาะวัชพืชใกล้แหล่งน้ำซึ่งเป็นที่อยู่อาศัยและขยายพันธุ์ของแมลงพาหะ</p> \
                                <p class="indent"><span class="bold">ใช้พันธุ์ข้าวต้านทานแมลงเพลี้ยจักจั่นปีกลายหยักและเพลี้ยจักจั่นสีเขียว</span>เช่น กข1 กข3 แต่ไม่ควรปลูกข้าวพันธุ์ดังกล่าวติดต่อกันเป็นแปลงขนาดใหญ่เนื่องจากแมลงสามารถปรับตัวเข้าทำลายพันธุ์ข้าวที่ต้านทานได้</p> \
                                <p class="indent"><span class="bold">ใช้สารป้องกันกำจัดแมลงพาหะ</span>ได้แก่ ใช้สารฆ่าแมลงในระยะที่แมลงเป็นตัวอ่อน เช่น ไดโนทีฟูเรน หรือ บูโพรเฟซิน หรือ อีโทเฟนพรอกซ์ ไม่ควรใช้สารฆ่าแมลงผสมกันหลายๆ ชนิดหรือใช้สารฆ่าแมลงผสมสารป้องกันกำจัดโรคพืชหรือสารกำจัดวัชพืช เพราะอาจทำให้ประสิทธิภาพของสารฆ่าแมลงลดลง</p> \
                                <p class="indent"><span class="bold">ไม่ใช้สารกลุ่มไพรีทรอยด์สังเคราะห์</span>เช่น ไซเพอร์มิทริน ไซฮาโลทริน เดลต้ามิทริน เนื่องจากสารกลุ่มนี้ไปทำลายแมลงศัตรูธรรมชาติ จึงทำให้เกิดการระบาดรุนแรงของเพลี้ยกระโดดสีน้ำตาล</p> \
                                 <p class="indent"><span class="bold">ถ้าปฏิบัติได้ เมื่อมีโรคระบาดรุนแรงควรงดปลูกข้าว 1–2 ฤดู เพื่อตัดวงจรชีวิตของแมลงพาหะ</span></p>'
                            ,unsafe_allow_html=True)   

            #* ไฟโตพลาสมา ------------------
            with st.expander('ไฟโตพลาสมา'):
                tab1r,tab2r = st.tabs([
                    'โรคใบสีแสด','โรคเหลืองเตี้ย'
                ])
                #TODO โรคสีแสด ---------------------------
                with tab1r:
                    tab1s,tab2s,tab3s,tab4s= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                    with tab2s:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อไฟโตพลาสมา</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">ภาคกลาง พบมากในนาชลประทาน</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1s:
                        st.image(Image.open('diseaseDataImage/โรคใบสีแสด1 1.jpeg').resize((300,300)))
                        st.markdown('<p class="indent">ข้าวเป็นโรคได้ ตั้งแต่ระยะแตกกอจนถึงระยะตั้งท้อง ต้นข้าวที่เป็นโรคนี้ ใบแสดงอาการสีแสดจากปลายใบที่ใบล่าง และเป็นสีแสดทั่วทั้งใบยกเว้นเส้นกลางใบ ใบที่เป็นโรคจะม้วนจากขอบใบทั้งสองข้างเข้ามาหาเส้นกลางใบ และใบจะแห้งตายในที่สุด ต้นข้าวสูงตามปกติ แต่แตกกอน้อย และตายอย่างรวดเร็ว โรคใบสีแสดนี้เกิดเป็นกอๆ ไม่แพร่กระจายเป็นบริเวณกว้างเหมือนโรคใบสีส้ม</p>'
                            ,unsafe_allow_html=True
                        )
                                            
                    with tab3s:
                        st.image(Image.open('diseaseDataImage/เพลี้ยจักจั่นปีกลายหยัก.jpeg').resize((300,300)))
                        st.markdown('<p class="indent">เชื้อสาเหตุโรคถ่ายทอดได้โดยแมลงพาหะ คือ เพลี้ยจักจั่นปีกลายหยักเชื้อสามารถอาศัยอยู่ตามวัชพืชและพืชอาศัยชนิดต่างๆ</p>',unsafe_allow_html=True)
                    with tab4s:
                        st.markdown('<p class="indent"><span class="bold">กำจัดหรือทำลายเชื้อสาเหตุโรค</span>โดยไถกลบหรือเผาตอซังในนาที่มีโรค กำจัดวัชพืช โดยเฉพาะวัชพืชใกล้แหล่งน้ำที่เป็นที่อยู่อาศัยและขยายพันธุ์ของแมลงพาหะ</p> \
                                <p class="indent"><span class="bold">ใช้พันธุ์ข้าวต้านทานแมลงเพลี้ยจักจั่นปีกลายหยัก</span>เช่น กข1 กข3 แต่ไม่ควรปลูกข้าวพันธุ์ดังกล่าว ติดต่อกันเป็นแปลงขนาดใหญ่ เนื่องจากแมลงสามารถปรับตัว เข้าทำลายพันธุ์ข้าวที่ต้านทานได้</p> \
                                <p class="indent"><span class="bold">ใช้สารป้องกันกำจัดแมลงพาหะ</span>ได้แก่ ใช้สารฆ่าแมลงในระยะที่แมลงเป็นตัวอ่อน เช่น ไดโนทีฟูเรน หรือ บูโพรเฟซิน หรือ อีโทเฟนพรอกซ์ ไม่ควรใช้สารฆ่าแมลงผสมกันหลายๆ ชนิดหรือใช้สารฆ่าแมลงผสมสารป้องกันกำจัดโรคพืชหรือสารกำจัดวัชพืช เพราะอาจทำให้ประสิทธิภาพของสารฆ่าแมลงลดลง</p> \
                                <p class="indent"><span class="bold">ไม่ใช้สารกลุ่มไพรีทรอยด์สังเคราะห์</span>เช่น ไซเพอร์มิทริน ไซฮาโลทริน เดลต้ามิทริน เนื่องจากสารกลุ่มนี้ไปทำลายแมลงศัตรูธรรมชาติ จึงทำให้เกิดการระบาดรุนแรงของเพลี้ยกระโดดสีน้ำตาล</p> \
                                 <p class="indent"><span class="bold">ถ้าปฏิบัติได้ เมื่อมีโรคระบาดรุนแรงควรงดปลูกข้าว 1–2 ฤดู เพื่อตัดวงจรชีวิตของแมลงพาหะ</span></p>'
                            ,unsafe_allow_html=True)   

                #TODO โรคเหลืองเตี้ย ---------------------------
                with tab2r:
                    tab1t,tab2t,tab3t,tab4t= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                    with tab2t:  
                        st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">เชื้อไฟโตพลาสมา</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">ภาคกลาง และภาคเหนือตอนกลาง พบมากในนาชลประทาน</p>'
                                , unsafe_allow_html=True
                        )  
                    with tab1t:
                        st.image(Image.open('diseaseDataImage/rice_yellow dwarf-05-016.jpg').resize((300,300)))
                        st.markdown('<p class="indent">โรคนี้พบในระยะข้าวแตกกอถึงระยะออกรวง ใบที่ออกใหม่มีอาการเหลืองซีด ต้นเตี้ย แตกกอมากเป็นพุ่มแจ้ ต้นเป็นโรคอาจตายหรือไม่ออกรวง ถ้าต้นข้าวได้รับเชื้อใกล้ระยะออกรวง จะไม่แสดงอาการ แต่จะแสดงอาการในลูกข้าวที่งอกจากตอซัง</p>'
                            ,unsafe_allow_html=True
                        )
                                            
                    with tab3t:
                        st.image(Image.open('diseaseDataImage/เพลี้ยจักจั่นสีเชียว.jpeg').resize((300,300)))
                        st.markdown('<p class="indent">เชื้อสาเหตุโรคถ่ายทอดได้โดยแมลงพาหะ คือ เพลี้ยจักจั่นสีเขียว</p>',unsafe_allow_html=True)
                    with tab4t:
                        st.markdown('<p class="indent"><span class="bold">กำจัดหรือทำลายเชื้อสาเหตุโรค</span>โดยไถกลบหรือเผาตอซังในนาที่มีโรค กำจัดวัชพืช โดยเฉพาะวัชพืชใกล้แหล่งน้ำที่เป็นที่อยู่อาศัยและขยายพันธุ์ของแมลงพาหะ</p> \
                                <p class="indent"><span class="bold">ใช้พันธุ์ข้าวต้านทานแมลงเพลี้ยจักจั่นสีเขียว</span>เช่น กข1 กข3 แต่ไม่ควรปลูกข้าวพันธุ์ดังกล่าว ติดต่อกันเป็นแปลงขนาดใหญ่ เนื่องจากแมลงสามารถปรับตัว เข้าทำลายพันธุ์ข้าวที่ต้านทานได้</p> \
                                <p class="indent"><span class="bold">ใช้สารป้องกันกำจัดแมลงพาหะ</span>ได้แก่ ใช้สารฆ่าแมลงในระยะที่แมลงเป็นตัวอ่อน เช่น ไดโนทีฟูเรน หรือ บูโพรเฟซิน หรือ อีโทเฟนพรอกซ์ ไม่ควรใช้สารฆ่าแมลงผสมกันหลายๆ ชนิดหรือใช้สารฆ่าแมลงผสมสารป้องกันกำจัดโรคพืชหรือสารกำจัดวัชพืช เพราะอาจทำให้ประสิทธิภาพของสารฆ่าแมลงลดลง</p> \
                                <p class="indent"><span class="bold">ไม่ใช้สารกลุ่มไพรีทรอยด์สังเคราะห์</span>เช่น ไซเพอร์มิทริน ไซฮาโลทริน เดลต้ามิทริน เนื่องจากสารกลุ่มนี้ไปทำลายแมลงศัตรูธรรมชาติ จึงทำให้เกิดการระบาดรุนแรงของเพลี้ยกระโดดสีน้ำตาล</p>'
                            ,unsafe_allow_html=True)   

            #* ไส้เดือนฝอย ------------------
            with st.expander('ไส้เดือนฝอย'):
                st.markdown('<p class="selected-tab">โรครากปม</p>',unsafe_allow_html=True)
                #TODO โรครากปม ---------------------------
                tab1u,tab2u,tab3u,tab4u= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                with tab2u:  
                    st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                    <p class="indent">ไส้เดือนฝอยรากปม Meloidogyne graminicola</p> \
                                    <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                    <p class="indent">ภาคเหนือ ภาคตะวันออกเฉียงเหนือ พบมากในนาน้ำฝน</p>'
                                , unsafe_allow_html=True
                    )  
                with tab1u:
                    st.image(Image.open('diseaseDataImage/โรครากปม.jpeg').resize((300,300)))
                    st.markdown('<p class="indent">มักเกิดในแปลงกล้าซึ่งปล่อยให้น้ำแห้ง เมื่อไส้เดือนฝอยตัวอ่อนระยะที่ 2 ฝังหัวเข้าไปที่ปลายรากอ่อนแล้ว จะปล่อยสารออกมากระตุ้นให้เนื้อเยื่อบริเวณรอบๆ นั้นแบ่งตัวเร็ว และมากกว่าปกติ นอกจากนี้จะมีเซลล์ขนาดใหญ่เกิดขึ้น เนื่องจากไส้เดือนฝอยปล่อยน้ำย่อยไปย่อยผนังเซลล์หลายเซลล์ทำให้เกิดเซลล์ใหม่ขนาดใหญ่ขึ้นมา และมันจะดูดกินน้ำเลี้ยงจากเซลล์นี้ ทำให้เกิดรากพองขึ้นเป็นปม เมื่อปลายรากเกิดปมขึ้นแล้วรากนั้นก็จะไม่เจริญต่อไป ถ้ามีปมน้อยอาการไม่ปรากฏที่ใบ ถ้ามีปมมากจะทำให้ต้นข้าวแคระแกร็นและใบมีสีเหลืองได้</p>'
                            ,unsafe_allow_html=True
                    )             
                with tab3u:
                        st.markdown('<p class="indent">ไส้เดือนฝอยแพร่ระบาดได้ทั้งทางดิน น้ำ และเศษซากพืช พืชอาศัยของไส้เดือนฝอยนี้มีมากมายหลายประเภท ได้แก่ พวกวัชพืชกก , พืชตระกูลหญ้า, วัชพืชใบกว้าง และวัชพืชน้ำ</p>',unsafe_allow_html=True)
                with tab4u:
                        st.markdown('<p class="indent"><span class="bold">ขังน้ำท่วมแปลงนานกว่า 30 วัน หรือไถตากดินให้แห้ง</span></p> \
                                <p class="indent"><span class="bold">ปลูกพืชอื่นที่ไม่ใช่พืชอาศัยหมุนเวียน</span>เช่น ดาวเรือง ตะไคร้ เพื่อลดจำนวนไส้เดือนฝอยรากปมในดิน</p>'
                            ,unsafe_allow_html=True)   

            #* สารพิษในดิน ------------------
            with st.expander('สารพิษในดิน'):
                st.markdown('<p class="selected-tab">โรคเมาตอซัง</p>',unsafe_allow_html=True)
                #TODO โรคเมาตอซัง ---------------------------
                tab1w,tab2w,tab3w,tab4w= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                with tab2w:  
                    st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                        <p class="indent">เกิดจากการของสารพิษ (H2S) ในดิน เกิดจากการสลายของตอซังที่ไม่สมบูรณ์</p> \
                        <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                        <p class="indent">ภาคกลาง พบมากในนาชลประทาน</p>'
                        , unsafe_allow_html=True
                    )  
                with tab1w:
                    st.image(Image.open('diseaseDataImage/โรคเมาตอซัง.jpeg').resize((300,300)))
                    st.markdown('<p class="indent">เริ่มพบอาการเมื่อข้าวอายุประมาณ 1 เดือน หรือระยะแตกกอ ต้นข้าวจะแสดงอาการคล้ายขาดธาตุไนโตรเจน ต้นแคระแกร็น ใบซีดเหลืองจากใบล่างๆ มีอาการโรคใบจุดสีน้ำตาล จะพบเมื่อการเน่าสลายของเศษซากพืชในนายังไม่สมบูรณ์ ทำให้เกิดสารพิษ เช่น สารซัลไฟด์ ไปทำลายรากข้าวทำให้เกิดอาการรากเน่าดำ รากไม่สามารถดูดธาตุอาหารจากดินได้ ต้นข้าวจึงแสดงอาการขาดธาตุอาหาร และจะสร้างรากใหม่ในระดับเหนือผิวดิน ปัญหานี้มักเกิดจากการที่เกษตรกรทำนาอย่างต่อเนื่อง และไม่มีการพักนา</p>'
                        ,unsafe_allow_html=True
                    )
                with tab3w:
                        st.markdown('<p class="indent">เนื่องจากเป็นโรคที่ไม่มีเชื้อสาเหตุ จึงไม่มีการระบาดติดต่อกัน</p>',unsafe_allow_html=True)
                with tab4w:
                        st.markdown('<p class="indent"><span class="bold">ระบายน้ำเสียในแปลงออก ทิ้งให้ดินแห้งประมาณ 1 สัปดาห์ เพื่อให้รากข้าวได้รับอากาศ หลังจากนั้นจึงนำน้ำใหม่เข้าและหว่านปุ๋ย</span></p> \
                                <p class="indent"><span class="bold">หลังเก็บเกี่ยวข้าว ควรทิ้งระยะพักดินประมาณ 1 เดือน</span>ไถพรวนแล้วควรทิ้งระยะให้ตอซังเกิดการหมักสลายตัวสมบูรณ์อย่างน้อย 2 สัปดาห์</p> \
                                <p class="indent"><span class="bold">ไม่ควรให้ระดับน้ำในนาสูงมากเกินไปและมีการไหลเวียนของน้ำอยู่เสมอ</span></p>'
                            ,unsafe_allow_html=True)   

            #* ไม่ทราบสาเหตุ ------------------
            with st.expander('ไม่ทราบสาเหตุ'):
                st.markdown('<p class="selected-tab">โรคใบแถบแดง</p>',unsafe_allow_html=True)
                #TODO โรคใบแถบแดง ---------------------------
                tab1v,tab2v,tab3v,tab4v= st.tabs(['อาการของโรค','สาเหตุของโรคและภูมิภาคที่พบ','การแพร่ระบาด','การป้องกัน'])
                with tab2v:  
                    st.markdown('<h5 class="tab-subhead">สาเหตุของโรค</h5> \
                                <p class="indent">ยังไม่มีความชัดเจน ซึ่งอาจเกิดจากเชื้อแบคทีเรีย Microbacterium sp. หรือเชื้อรา Gonatophragmium sp.</p> \
                                <h5 class="tab-subhead">ภูมิภาคที่พบ</h5> \
                                <p class="indent">ภาคกลาง ภาคเหนือ และภาคตะวันออกเฉียงเหนือ พบมากในนาน้ำฝน และนาชลประทาน</p>'
                            , unsafe_allow_html=True
                    )  
                with tab1v:
                    st.image(Image.open('diseaseDataImage/โรคใบแถบแดง.jpeg').resize((300,300)))
                    st.markdown('<p class="indent">เริ่มแรกใบข้าวจะเป็นจุดสีเหลืองแผลเป็นรูปกลมหรือรูปไข่ จากนั้นจะขยายจากจุดที่เริ่มเป็นขึ้นเป็นแถบไปทางปลายใบ สีของแผลจะเข้มขึ้นเป็นสีเหลืองส้ม บางครั้งจุดนี้จะมีสีเข้ม แผลที่เกิดขึ้นเมื่อเป็นรุนแรงจะแห้งทั้งใบ</p>'
                        ,unsafe_allow_html=True
                    )
                with tab3v:
                        st.markdown('<p class="indent">สามารถถ่ายทอดได้โดยการสัมผัส ทางบาดแผล และรูเปิดตามธรรมชาติ</p>',unsafe_allow_html=True)
                with tab4v:
                        st.markdown('<p class="indent"><span class="bold">ในดินที่อุดมสมบูรณ์ไม่ควรใส่ปุ๋ยไนโตรเจนมาก</span></p> \
                                <p class="indent"><span class="bold">ป้องกันกำจัดด้วยสารป้องกันกำจัดโรคพืช</span>เช่น คาร์เบนดาซิม ไธโอฟาเนทเมทิล และโพรพิโคนาโซล+ไดฟีโนโคนาโซล ตามอัตราที่ระบุ</p>'
                            ,unsafe_allow_html=True)   
